{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Couple, VisionBoard, Planner, Journal entries) and backend state, with authorization setup via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping the Dashboard Today's Inspiration daily quote feature (REQ-2) to its implementation file `frontend/src/hooks/useQueries.ts` with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short human-readable summaries of each frontend source file, describing their purpose and notable implementation details.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app with the page title set to \"Future Us\" and a script tag loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with all page routes, a navigation bar, profile setup modal, couple mode badge, and Internet Identity login/logout controls.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP actor, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status derived from the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, daily quotes, vision board entries, daily planner entries, couple management, and journal entries (daily, emotional, night reflection, growth).",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for a warm cream/amber light theme and a dark theme, plus a few reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CoupleSettings.tsx": "Page for managing couple connections, allowing users to copy their principal ID, link a partner by principal, and view or disconnect an existing couple relationship.",
  "frontend/src/pages/DailyPlanner.tsx": "Daily planner page with date navigation that lets users log schedule items, tasks, water intake, mood, gratitude entries, and a journal entry, persisting data via backend mutations.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying a daily inspirational quote, vision board progress summary, today's planner tasks, and quick-navigation cards to other app sections.",
  "frontend/src/pages/JournalSection.tsx": "Tabbed journal section with four journal types (daily, emotional, night reflection, growth), each supporting date navigation and saving entries to the backend.",
  "frontend/src/pages/MonthlyPlanner.tsx": "React page for a monthly planner that lets couples track goals, important dates, budgets, and a per-day mood grid, with navigation between months and save/update via backend queries.",
  "frontend/src/pages/VisionBoard.tsx": "React page for a shared vision board where users can add, update progress on, and delete categorized long-term goals with milestones, displayed as color-coded cards with progress bars.",
  "frontend/src/pages/WeeklyPlanner.tsx": "React page for a weekly planner supporting ISO-week navigation, priorities, a habit tracker grid with daily check-ins, todos, reflection, and energy rating, saved to the backend.",
  "frontend/src/pages/YearlyPlanner.tsx": "React page for a yearly planner with a word-of-the-year, major goals, vision image URLs, a monthly habit tracker grid, and a reflection field, navigable by year.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters from both standard and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts, OKLCH-based color tokens (including warm, pastel-brown, cream, amber, rose, taupe palettes), border radii, box shadows, and enabling dark mode via class. Includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3) for the 'Future Us' app, recording existing features (dashboard daily quote fetching) and pending new feature requests (AR-1, AR-2) related to automatically rotating daily inspirational quotes sourced from a backend curated list."
}