{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Couple, planner entries, journal entries) and state maps for a couples planning/journaling app, with authorization setup via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping two features — a React Query hook for fetching partner journal entries and a read-only partner journal view tab — to their target files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their purpose, recent changes, and key implementation details for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell titled 'Future Us' that mounts the React app at the #root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all page routes, a navigation bar, a profile setup modal, and a couple-mode badge using Internet Identity authentication.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated (or anonymous) ICP actor instance, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity context to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend data operations including user profiles, couple management, vision board, daily planner, and journal entries. Also exports a custom CoupleCreateErrorException class for typed error handling.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, and defines CSS custom properties for a warm cream/amber color palette in both light and dark modes, plus shared component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider (React Query) and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/CoupleSettings.tsx": "Page component for managing couple connections, allowing users to link with a partner via Principal ID or dissolve an existing couple, with error handling and confirmation dialogs.",
  "frontend/src/pages/DailyPlanner.tsx": "Daily planner page with date navigation, mood selection, task management, schedule items, water intake tracking, and a read-only partner view tab showing the partner's planner for the selected date.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying a daily inspirational quote banner, today's planner progress, vision board goal summaries, and quick-navigation cards to other app sections.",
  "frontend/src/pages/JournalSection.tsx": "Journal page with tabbed views for four journal types (daily, emotional, night reflection, growth), date navigation, editable forms with emotion/growth-area tag selectors, and a read-only partner journal tab.",
  "frontend/src/pages/MonthlyPlanner.tsx": "React page for a monthly planner that lets users manage goals, important dates, budgets, moods, and notes for a selected month, with a read-only partner view fetched via couple-aware queries.",
  "frontend/src/pages/VisionBoard.tsx": "React page for a vision board where users can create, edit, delete, and track progress on categorized yearly goals, with a read-only view of a linked partner's entries.",
  "frontend/src/pages/WeeklyPlanner.tsx": "React page for a weekly planner supporting priorities, habit tracking, tasks, and reflections for ISO-week-based entries, with a read-only partner view and week navigation.",
  "frontend/src/pages/YearlyPlanner.tsx": "React page for a yearly planner covering word-of-the-year, major goals, vision images, and habit tracking across months, with a read-only partner view and year navigation.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, store, and clear URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Playfair Display, Lato), oklch-based color tokens (cream, amber, rose, taupe, pastel-brown, sidebar, chart), border radii, and warm box shadows, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the 'Future Us' shared daily planner/journal app, listing two completed features (partner journal React Query hook and read-only partner journal tab) and two pending action requests (backend partner journal endpoint with couple-based access control and the overall partner journal visibility feature)."
}