{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Couple, planner entries, journal entries) and state maps, with authorization setup via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping four partner-view features (yearly, monthly, weekly planner partner tabs and React Query hooks) to their target files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing their purpose, recent fixes, and key functionality for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML shell titled 'Future Us' that mounts the React app at the `#root` div via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with all page routes, a navigation bar, profile setup modal, couple mode badge, and Internet Identity login/logout controls.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated (or anonymous) ICP backend actor, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor calls, covering user profiles, couples, vision board entries, daily planner entries, and journal entries.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for a warm cream/amber light theme and a dark theme, plus a few shared component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CoupleSettings.tsx": "Page component for managing couple connections, allowing users to copy their Principal ID, link a partner by their Principal, and view or disconnect an existing couple relationship.",
  "frontend/src/pages/DailyPlanner.tsx": "Page component for a day-by-day planner where users can log schedule items, tasks, mood, water intake, gratitude entries, and a journal entry, with navigation between dates.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays a daily inspirational quote, weekly task progress, vision board goal summaries, and quick-navigation cards to other app sections.",
  "frontend/src/pages/JournalSection.tsx": "Provides a tabbed journaling interface with four journal types (daily, emotional, night reflection, growth), each supporting date navigation and CRUD operations via React Query hooks.",
  "frontend/src/pages/MonthlyPlanner.tsx": "Renders a monthly planner with editable goals, tasks, important dates, budget, mood, and notes for the current user, plus a read-only view of the partner's monthly entry.",
  "frontend/src/pages/VisionBoard.tsx": "Displays a vision board of categorized long-term goals with progress tracking, and supports adding, updating progress, and deleting entries via modals, with a partner read-only view.",
  "frontend/src/pages/WeeklyPlanner.tsx": "Implements a weekly planner with ISO-week navigation, allowing the user to manage priorities, tasks, habits, and energy levels, while showing a read-only view of the partner's weekly entry.",
  "frontend/src/pages/YearlyPlanner.tsx": "Provides a yearly planner with year navigation for setting a word of the year, major goals, vision images, and a monthly habit tracker, alongside a read-only partner view.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens (warm palette, sidebar, charts), border radii, and box shadows, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file listing existing implemented features (partner-view tabs for yearly, monthly, and weekly planners plus React Query hooks) and two pending tasks (daily planner partner view and backend partner query endpoints)."
}