{
  "kind": "build_request",
  "title": "Auto-rotate daily quotes in Today's Inspiration section",
  "projectName": "Future Us",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Store a curated list of inspirational quotes in the backend and expose a function that deterministically returns a quote based on the current date (e.g., using a day-of-year index into the quotes array), so a different quote is shown each calendar day without any manual intervention.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Change quotes in today's inspiration section automatically everyday"
        ]
      },
      "acceptanceCriteria": [
        "The backend holds at least 30 distinct inspirational quotes.",
        "A query function accepts no arguments and returns the quote assigned to the current UTC date.",
        "The returned quote changes when the calendar date changes (different day = different quote).",
        "The same date always returns the same quote (deterministic selection)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Dashboard's Today's Inspiration section to fetch the daily quote from the backend using the date-based query introduced in REQ-1, replacing any hardcoded or static quote. The displayed quote must update automatically each new day without requiring a page reload mid-session beyond normal daily visits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Change quotes in today's inspiration section automatically everyday"
        ]
      },
      "acceptanceCriteria": [
        "The Today's Inspiration section on the Dashboard displays the quote returned by the backend's daily-quote query.",
        "Visiting the Dashboard on different calendar days shows different quotes.",
        "No quote is hardcoded in the frontend source.",
        "Existing pastel brown text styling and transparent background of the section are preserved."
      ]
    }
  ],
  "constraints": [
    "Preserve the existing transparent background and pastel brown text styling of the Today's Inspiration section.",
    "Do not break or modify other dashboard sections."
  ],
  "nonGoals": [
    "Allowing users to manually select or favorite quotes.",
    "User-submitted or editable quote lists.",
    "Real-time quote refresh within a single session without a page interaction.",
    "Push notifications for daily quotes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}