{
  "kind": "build_request",
  "title": "Allow partners to view each other's journal entries",
  "projectName": "Future Us",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend endpoint that retrieves journal entries for a given user's partner, enforcing couple-based access control so only linked partners can read each other's journal data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Allow partner to see the jouranal of each other"
        ]
      },
      "acceptanceCriteria": [
        "A query function exists that returns all journal entry types (daily, emotional, night reflection, growth) for the caller's linked partner.",
        "The function returns an error or empty result if the caller is not in a couple with the target user.",
        "Unlinked users cannot access any journal entries of another user."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a React Query hook in useQueries.ts to fetch the partner's journal entries from the new backend endpoint, following the same pattern used for partner daily planner data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Allow partner to see the jouranal of each other"
        ]
      },
      "acceptanceCriteria": [
        "A useQuery hook exists that fetches partner journal entries.",
        "The hook is only active when the user is in a coupled state.",
        "Loading and error states are handled."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a read-only partner journal view tab in JournalSection.tsx that displays the partner's journal entries across all four journal types (daily, emotional, night reflection, growth), consistent with the read-only partner view pattern used in DailyPlanner, WeeklyPlanner, MonthlyPlanner, and VisionBoard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Allow partner to see the jouranal of each other"
        ]
      },
      "acceptanceCriteria": [
        "A 'Partner's Journal' tab or toggle appears in JournalSection only when the user is linked to a partner.",
        "All four journal types are viewable in read-only mode from the partner's perspective.",
        "No edit or save controls are shown in the partner view.",
        "Date navigation works in the partner view to browse different entries.",
        "The partner view is visually consistent with other partner view tabs in the app."
      ]
    }
  ],
  "constraints": [
    "Do not allow any user to edit or delete a partner's journal entries.",
    "Partner journal access must be gated on an active couple relationship — unlinked users must not see any partner journal data.",
    "Follow the existing read-only partner view pattern established in DailyPlanner, WeeklyPlanner, MonthlyPlanner, and VisionBoard."
  ],
  "nonGoals": [
    "Real-time sync or notifications when a partner updates their journal.",
    "Shared or collaborative journal entries.",
    "Any changes to the existing journal entry creation or editing flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}