{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-28T03:59:08.833Z",
  "summary": "The diff implements partner-view sections for YearlyPlanner, MonthlyPlanner, WeeklyPlanner, and DailyPlanner pages, adds corresponding React Query hooks in useQueries.ts, and updates the backend. Most requirements appear substantially implemented. However, the backend diff is truncated making it difficult to fully verify REQ-5's access restriction requirement, and the DailyPlanner page diff is not shown directly (only referenced in the file summary), making REQ-4 partially unverifiable.",
  "missing_requirements": [
    {
      "id": "REQ-5",
      "requirement": "Access is restricted so that only a linked couple partner can fetch the other's entries",
      "reason": "The backend/main.mo diff is truncated and does not show the implementation of partner planner query functions or their access control logic. It is not possible to confirm that the access restriction (only linked couple partner can fetch) is implemented.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-4",
      "requirement": "In the DailyPlanner page, add a partner-view tab or section that fetches and displays the partner's daily planner entry (schedule items, tasks, notes, water intake, mood, gratitude entries, and journal entry) for the currently selected date as read-only content.",
      "reason": "The DailyPlanner.tsx file is listed in the file summaries but its diff content is not shown. The summary mentions daily planner features but does not explicitly confirm partner-view tab/section with all required fields or empty state handling.",
      "evidence": [
        "frontend/src/pages/DailyPlanner.tsx",
        "frontend-file-summaries.txt"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Partner hooks for journal sections (useGetPartnerDailyJournals, useGetPartnerEmotionalJournals, useGetPartnerNightReflections, useGetPartnerGrowthJournals) were added",
      "reason": "The build request explicitly states as a non-goal modifying the JournalSection partner sharing behavior. Adding journal partner sharing hooks was not requested and falls outside scope.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts",
        "frontend-file-summaries.txt"
      ]
    }
  ],
  "confidence": 0.72,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/CoupleSettings.tsx",
    "frontend/src/pages/MonthlyPlanner.tsx",
    "frontend/src/pages/VisionBoard.tsx",
    "frontend/src/pages/WeeklyPlanner.tsx",
    "frontend/src/pages/YearlyPlanner.tsx",
    "project_state.json"
  ]
}